Rails/work/vagrant/Bookers2/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "jiij"], ["body", "jijiji"], ["user_id", 1], ["created_at", "2020-01-03 18:12:30.773193"], ["updated_at", "2020-01-03 18:12:30.773193"]]
SELECT "books".* FROM "books"
---
  def create
    @new_book = Book.new(book_params)
    @new_book.user_id = current_user.id
  	if @new_book.save
  		redirect_to @new_book, notice: "You have creatad book successfully."
  	else
  		@books = Book.all